public class Error
{
    public TextPosition Position { get; set; }
    public int Code { get; set; }
    public Error(int code, TextPosition position)
    {
        Code = code;
        Position = position;
    }
    public string GetDescription()
    {
        return Code switch
        {
            3 => "Должно идти служебное слово Program",
            4 => "Должен идти символ ')'",
            7 => "Недопустимый символ диапазона '..'",
            52 => "Должно идти слово then(после if)",

            6 => "Запрещённый символ",
            210 => "Ошибка в символьной константе",
            203 => "Целое число превышает предел",
            209 => "Вещественная константа превышает допустимый диапазон",
            205 => "Недопустимый формат вещественного числа",
            207 => "Пробел в имени идентификатора",
            204 => "Недопустимый символ в константе",
            206 => "Пустая символьная константа",
            208 => "Незакрытая символьная константа",
            _ => "неизвестная ошибка"
        };
    }
}
